[
{"url": "http://c32zjeghcp5tj3kb72pltz56piei66drc63vkhn5yixiyk4cmerrjtid.onion/f/guns/comments", "title": "Recent comments in /f/guns\n          —\n        Raddle", "title_keywords": {"recent": 1, "comments": 1, "fguns": 1, "": 9, "—": 1, "raddle": 1}, "keywords": {}, "description": "", "meta": {"download_slot": "c32zjeghcp5tj3kb72pltz56piei66drc63vkhn5yixiyk4cmerrjtid.onion", "download_latency": 0.9172775745391846, "depth": 0}, "Data": ["\n                  Reply to comment by ", " in ", " by ", "\n              ", "Ah man, I was hoping it would be less boring than that >:(", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "That s isn't FBI it's just run of the mill dark web scammer", "\n                  Reply to ", " by ", "\n              ", "Any of you here using red dots/night vision?\n@ Tuvaniko, Galco Miami like in Magnum PI is peak fashion :D\nI think I got mine on sale after reading bout it at ", " outdoor blog or smth.", "\n                  Reply to ", " by ", "\n              ", "CZ-75, Magnum research(might need to look for older models/on sale I'd say), Turkish Tisas does a pretty good job imo, but make sure to check ammo(mine doesn't like a steel-cased 45 ACP ammo for example) ", " 1911 from E-series is around 1.1k, that's a pretty good one too.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "The title read like you were asking for one so better to avoid this content here.", "We are not a darknet forum and because of the overall content of the site this is a sensible subject to fool around, sorry", "\n                  Reply to ", " by ", "\n              ", "Forum rules", "Soliciting is not allowed", "\n                  Reply to ", " by ", "\n              ", "Depends on if you are trying to make a pipe bomb or not.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "It's not a leather one unfortunately.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Back when I first watched The Nice Guys I've always wanted a shoulder holster. That's supreme drip right there", "\n                  Reply to ", " by ", "\n              ", "I'll be honest an LCP in a shoulder holster under my shirt. That's my gear.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Thank you for your praxis, found a copy and beginning to  study", "Addendum: turns out there 12 manuals all on google play for a few cents.", "Good thing I enjoy reading lol\nAnd thank you again", "\n                  Reply to ", " by ", "\n              ", "The us army publishes an improvised munitions handbook. Highly recommend.", "\n                  Reply to ", " by ", "\n              ", "You know, as someone who owns a revolver, I was thinking about this post and wanted to go against this, but in all honesty my life isn’t that important. If I get killed unarmed, I’ll be a martyr in some way or another, right?", "\n                  Reply to ", " by ", "\n              ", "Seems 100% legit", "\n                  Reply to ", " by ", "\n              ", "Elsewhere, Yankistan is regarded as strange for an unhealthy culture.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Huh, by that token couldnt someone use a firearm in self defense, heedless of collateral damages in an exercise of their own anarchic value of their own life versus others? If it's ", " ", " causing the collateral damage, and the people collaterally damaged don't matter to you,  how does that scenario not fit your anarchy?  I get how someone else shooting you stops you from doing anarchy, but the converse only matters if others adhere to the same principle. Like the principle is universal. Like if it's imposed by a state.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "not quite. See my ideas center around me. People who get the legal right to kill criminals and endanger others around them to save their hide includes me. See I don't value others life but I value mine a lot. So people who will save their hide but endanger mine are a massive threat to my anarchy. I can't do anarchy if I get shot to death bc strangers think its okay to shoot me to save themself. So its not anarchist to stop me from doing anarchy for no good reason which is someone I don't care about saving their life I don't value", "\n                  Reply to ", " by ", "\n              ", "I fell like i get your point - tell me if this is close: as anarchists the only authority we're answerable to is the good of our communities, so collateral damages are an unacceptable risk:; states make that risk acceptable by saying it's justifiable homicide in the name of self defense. The law doesn't punish it , so statists think that means it's good notwithstanding its actual effect.", "\n                  Reply to ", " by ", "\n              ", "I don't think it actually relates to anarchism.", "It may be considered irresponsible or \"bad\", but not really something anarchist or archist.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Like the title suggests if I start talking about all the baffling things I will be here all day. Tho I just kept going \"that gun isn't protecting u it's making ur likely hood of getting shot like 1000% more likely bc you're begging misfire\".", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "I actually wasn't looking for gun reviews I was more trying to imagine how realistic it would be to carry personal defense weapons on your person. Bc initially I didn't think it was practice but now that I know some people walk around with a p90 in their jacket it's kinda funny. Weirdly enough I've seen someone conceal carry a shotgun in their pants. Which was incredibly silly because it made it impossible for them to bend their knee.", "\n                  Reply to ", " by ", "\n              ", "ahahaha this is great.", "\"If you aint got no safety... you stiiiill can do it buuuut.... don't shoot your leg\"", "I wouldn't trust myself with carrying a supersoaker like that but here is is swaggering around with a loaded AR in his pants.", "\n                  Reply to ", " by ", "\n              ", "The Honest Outlaw seems to be an alright gun reviewer.  But I haven't watched a ton of videos yet.", "\n                  Reply to ", " by ", "\n              ", "Tho tbh while cringe this person is a vastly better gun reviewer bc he isn't racist.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "True.\nThough it is worth mentioning that some modern guns will work with black powder if they're a manual action as opposed to gas operated semis.\nLike shotguns, lever actions, and pump actions.", "Please practice and carry. Owning a gun means nothing unless you have it with you and can use it effectively.", "Soliciting is not allowed, please avoid posting links to marketplaces or store websites, sale alerts, etc.", "Please inform me of news websites relevant to non-usa areas of the world so I can add them", "\n          ", "\n        ", "\n          ", "\n        ", "\n          ", "\n        "]},
{"url": "http://c32zjeghcp5tj3kb72pltz56piei66drc63vkhn5yixiyk4cmerrjtid.onion/f/guns/comments?next%5Btimestamp%5D=2022-03-15T12%3A04%3A51%2B00%3A00&next%5Bid%5D=243240", "title": "Recent comments in /f/guns\n          —\n        Raddle", "title_keywords": {"recent": 1, "comments": 1, "fguns": 1, "": 9, "—": 1, "raddle": 1}, "keywords": {}, "description": "", "meta": {"depth": 1, "download_slot": "c32zjeghcp5tj3kb72pltz56piei66drc63vkhn5yixiyk4cmerrjtid.onion", "download_latency": 0.9140865802764893}, "Data": ["\n                  Reply to comment by ", " in ", " by ", "\n              ", "Yeah this is very true. It's not the same as being able to make all the componentts yourself. Plus most modern guns will not work if you use black powder rather than smokeless.", "So in this instance you are just as reliant on the supply chain than if you just bought the bullets. But still a note worth making.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Lol bold of you to assume I'm not enough of a mad man that I havnt been reading stuff like this since high school. In fact I actually have read this exact document. Lol but it is a cool read.", "I think improvised munitions is actually an important concept to learn. Because it changes how you view your environment and how difficult or easy it would be to make something incredibly dangerous. Plus u understand how the world works in a different way, some basic science principles and understand how easy it can be for people to make super dangerous shit.", "\n                  Reply to ", " by ", "\n              ", "I enjoy black powder for fun. For practical use I prefer modern guns.\nYou can still cast your own bullets for modern firearms too, you just have to get new primers and reuse the brass", "\n                  Reply to ", " by ", "\n              ", "sounds unreliable, too damp?= wont fire. too much powder? = mutilated hand. not enough?= wont fire", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "I completely agree with everything u said. Other than the idea of not knowing how much black powder to use. A grain measurement tool from my understanding would stop that problem.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "The issue with revolvers is getting the cylinder to consistently align with the barrel when it is rotated, and for that you need the guiding rails and locks to be precisely positioned. If the cylinder and barrel isn't properly in battery when you try to fire it then you risk the whole thing blowing up in your hand.", "Muskets are harder to fuck up in the making of them at least, as you aren't supposed to rifle the barrels and a flintlock system does not need to be super precise, it just needs a good seal when the flashpan is closed and decent spring force on the hammer. What is easy to fuck up, though, is loading it. Too little black powder and the ball won't clear the barrel, too much black powder and it can blow up. You get one good shot and if you miss then you're probably better off weilding it as a club than trying to load it again.", "Rolling block and falling block rifles are single shot but can be reloaded relatively quickly in trained hands. Not quick enough to match up to an AR-15 of course. If you're going up against modern firearms then all you really can do is fire that one shot and then run or hide.", "A lower tech alternative to the revolver might be the pepperbox. You get multiple barrels instead of a cylinder with individual chambers. You only have to align the barrel with the firing pin, and you do that by manually rotating the barrels, so you can fit it with a simpler locking system.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "I would push back on that tbh. I would say that for news to metal working it would take a while but tbh it's def a more medium level garage project. U just need a high powdered drill preferably drill press, stick welder and metal cutting power tool. Which I know multiple people who aren't gun smiths who can follow the DIY schematics online. I'm not saying it's easy or it will be as good as a bought one but it's extremely possible for an individual to do in their garage.", "Tho from what I can tell homemade rifles suck bc it's hard to rifle the barrels properly. So their accuracy will be shit. Tho pistols are far more reasonable for an individual to make. I would go as far to say if u had the equipment already the easiest way to get a useless gun like the Full auto Mac 10 is to DIY.", "Tbh I find black powder rifles to not be too worth while as unless u are hunting one shot just sucks. It's just so much worse than an ar 15. Tho revolver actually makes sense bc it is at least closer in power to modern pistols.", "I think u can buy a black powder rifle with 6 shots but I find that less helpful relatively speaking.", "\n                  Reply to ", " by ", "\n              ", "Revolvers are quite delicate mechanically, not the sort of thing you could make in your dad's garage if you're going DIY all the way. Muskets, on the other hand...", "Now that I think of it, I've seen pictures and videos of hunters and guerillas in South East Asia who have machined their own rolling block rifles firing black powder cartridges. That would be a step up above a musket at least.", "\n                  Reply to ", " by ", "\n              ", "Tho they clearly have some problems due to having like no safety features.", "\n                  Reply to ", " by ", "\n              ", "I rate this post as cringe. But those hookup scammer fucks allways piss me off and think of those predatory homophobes who have absoluteky traumatized plenty of gay people so I do feel better writing this lol. Plus I'll link it when people talk about being violent for reasons I don't like. Plus it will be interesting to send pro violence people s guide that can easily put them in a situation where it's fairly easy and justifiable to kill someone.", "\n                  Reply to ", " by ", "\n              ", "Is the government pension still pretty good? I know being a fed doesn’t pay a ton, but I’ve heard the retirement benefits are sweet.", "\n                  Reply to ", " by ", "\n              ", "Never heard of you.", "Do you have more information for why you want guns?", "\n                  Reply to ", " by ", "\n              ", "I got some super soakers, will that work?", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "thanks for this!", "\n                  Reply to ", " by ", "\n              ", "seems not safe", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Alright. Any of the following pistols will do fine. As tabby mentioned the CZ-75, Sig sauer p2xx series but I'll add the berreta 92 or the cheaper taurus copy of the same pistol.", "9mm is the smallest round I'd use for self defense. Also the 1911 is an archaic design and I feel its just a range toy.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Something for home defense and range shooting. Any affordable caliber larger than .22", "\n                  Reply to ", " by ", "\n              ", "I need more info. What are you looking for? Full size or carry size? caliber preference?", "\n                  Reply to ", " by ", "\n              ", "Some 1911s, CZ-75, or Sig Sauer P2XX series.", "I wouldn't discount polymer though. The slide isn't polymer and therefore won't wear out any faster than with a metal-frame handgun, and even polymer frames are made to last tens of thousands of rounds before they wear out. Just get a Glock.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Yes, that's correct, luckily", "\n                  Reply to ", " by ", "\n              ", "That was entertaining! I've read that America had more guns than people.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "it also qualifies as spam under the site wide rules since they're trying to sell something, so I'll delete it if you won't", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "I was thinking about that as I posted the comment, but my mindset was that it might be legit and maybe abundant warning would suffice. Really torn as to what to do, but since I can't edit titles and add a warning there I will probably just make a rule against soliciting and chalk it up under that", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "i think there should be a rule that prevents potential honeypots like this from being posted", "\n                  Reply to ", " by ", "\n              ", "Why buy guns from the black market when you can just head to a gun show or festival? Or from a friend?", "You cops are clueless", "Please practice and carry. Owning a gun means nothing unless you have it with you and can use it effectively.", "Soliciting is not allowed, please avoid posting links to marketplaces or store websites, sale alerts, etc.", "Please inform me of news websites relevant to non-usa areas of the world so I can add them", "\n          ", "\n        ", "\n          ", "\n        ", "\n          ", "\n        "]},
{"url": "http://c32zjeghcp5tj3kb72pltz56piei66drc63vkhn5yixiyk4cmerrjtid.onion/f/guns/comments?next%5Btimestamp%5D=2020-08-17T00%3A12%3A37%2B00%3A00&next%5Bid%5D=182954", "title": "Recent comments in /f/guns\n          —\n        Raddle", "title_keywords": {"recent": 1, "comments": 1, "fguns": 1, "": 9, "—": 1, "raddle": 1}, "keywords": {}, "description": "", "meta": {"depth": 2, "download_slot": "c32zjeghcp5tj3kb72pltz56piei66drc63vkhn5yixiyk4cmerrjtid.onion", "download_latency": 0.9034349918365479}, "Data": ["\n                  Reply to comment by ", " in ", " by ", "\n              ", "What is the purpose of that link? It was not stated an executive order would be used, nor would that be constitutional", "She has stated support for mandatory buybacks (fancy political way to say confiscation)", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "My point is that isosceles stance (especially the power isosceles) allows one to draw faster, acquire the target faster, get the first shot faster, and absorb more recoil naturally which allows faster target re-acquisition to follow up with more shots faster.", "Extrapolate on this please, I do not understand how it allows me to draw faster, or do anything you described faster than any other stance. I draw about the same speed with both stances, unless you are talking about assuming the stance, which is much slower for me in the isosceles stance so I could argue the weaver allows people to draw faster (but I'm not going to, because it only allows me to draw faster, apparently).", "What you should have said is this:", "My point is that isosceles stance (especially the power isosceles) allows ", " ", " to draw faster, acquire the target faster, get the first shot faster, and absorb more recoil naturally which allows faster target re-acquisition to follow up with more shots faster.", "This stance is particularly useful for smaller stature people who may have more difficulty managing recoil as it isn't as much dependent on active muscular tension.", "I agree, and if the stance works for you and your situation, wonderful! But other stances work for other people, believe it or not. And they will not \"get people killed\"", "Also, I take offense that you would assume my preference of the isosceles stance, that the winners in competitions since the 1980's have adopted, is equated with spending my time hanging around bootlicking tools and cops. I care about my community, including you, and want them to train with the best known tools available.", "Great, then perhaps you understand why I took offense to you telling me that the stance I use to shoot handguns in will get me or other people killed, when it obviously will not. There is no universal best, absolutely perfect stance that everyone should use because a competition shooter uses it", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "I will admit that \"get someone killed\" was a knee jerk reaction to what I feel is poor shooting advice. I will also point out that if you use the \"200 yard shot upside down with a snub nose revolver\" trick shot without context of what he says before making that shot, then you are dismissing the expertise of this marksman's advice based on the fact that he's presenting some trick shot videos as well as instructional videos. He says in literally dozens of videos that \"anybody can make any shot in any stance given enough time\".", "Jerry Miculek has been winning competitions for more than 30 years, and has had to adapt his techniques to keep winning and has discovered that the most effective stance for winning right now is the isosceles stance.", "My point is that isosceles stance (especially the power isosceles) allows one to draw faster, acquire the target faster, get the first shot faster, and absorb more recoil naturally which allows faster target re-acquisition to follow up with more shots faster. This stance is particularly useful for smaller stature people who may have more difficulty managing recoil as it isn't as much dependent on active muscular tension.", "In competition shooting this means winning because of the time spent on target instead of managing moving one's body and managing recoil. Outside of competition I hope that might translate to me being able to defend my life or that of someone in my community's life vs not. I'll only get one chance in a competition... and in a self defense situation I'll potentially only get one chance to defend myself. Therefore, I should prepare with the best practices available to me at the time and adapt if they change.", "So yeah, I'm being serious about my preference to shoot with isosceles stance.", "Also, I take offense that you would assume my preference of the isosceles stance, that the winners in competitions since the 1980's have adopted, is equated with spending my time hanging around bootlicking tools and cops. I care about my community, including you, and want them to train with the best known tools available.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Are you being serious? Lots of people use the weaver stance, unless you only hang around cops. What stance you use is mostly personal preference and the weaver stance will definitely not \"get someone killed\"", "Feel free to add to the wiki, was definitely planning on adding a section on other shooting stances eventually, but did not intend to lie and say \"the weaver stance will get someone killed\" by linking to someone who is supposed to be trusted for landing a 200 yard shot upside down with a snub nose revolver (remind me when I will be shooting upside down at someone ever in my life? especially with a snub nose revolver at 200 yards?)", "\n                  Reply to ", " by ", "\n              ", "This weaver stance shit is going to get someone killed - no one uses it anymore - use isosceles ", " ", "But don't take it from me - learn from the fastest guns out there.", "\n                  Reply to ", " by ", "\n              ", "Thanks for this.", "\n                  Reply to ", " by ", "\n              ", "\n                  Reply to ", " by ", "\n              ", "thanks for starting this effort", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "i look forward to your contributions!", "\n                  Reply to ", " by ", "\n              ", "I agree. I'll apply for mod so I can change them. Plus the sidebar could use some useful links", "\n                  Reply to ", " by ", "\n              ", "rules should be modified. selling guns on here would be a bad idea", "\n                  Reply to ", " by ", "\n              ", "Can you repost to coinsh.red", "\n                  Reply to ", " by ", "\n              ", "imagine giving away your guns to a local gang", "\n                  Reply to ", " by ", "\n              ", "I was at preparation for a careers expo. Someone from the lock-up mentioned that they had a riot-gear suit of armor, and asked whether that should be displayed. I asked whether it was ever used. \"Oh no,\" I was told\", \"we use communication skills!\". So they got to play a communication video, unstead.", "\n                  Reply to ", " by ", "\n              ", "I understand that Yankistan has a big underclass!", "\n                  Reply to ", " by ", "\n              ", "That's too tiny for reading!", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Again the result is very rough. So much finishing would be required.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "I saw a 3D printer built from a kit, and then operated. The construction involved a lot of swearing! And it needed to have a room-heater under its table, to stop the work-in-progress from peeling off its substrate! The result was very rough, so I expect that finishing would be required.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Not that the machine is affordable lol", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Metal 3D Printing exists!", "\n                  Reply to ", " by ", "\n              ", "I don't want to set-off an explosion in a piece of plastic!", "\n                  Reply to ", " by ", "\n              ", "\n", "\n                  Reply to ", " by ", "\n              ", "Well, I guess I'll keep my eye on the darknet instead of F5ing their website. When people want controversial engineering data, it becomes a real hot cake.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "There's a good meme/propaganda thing there:", "You want Gun Control? Go to Prison, it's working great there!", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Not to mention that the government is already helping the fascists fight Anarchists, imagine if they grabbed all the guns too. I think a good example of why gun control won't stop violence/bigotry/racism/sexism is to look at the prisons. There is technically \"gun control\" in effect there, and the prisons are effectively structured to facillitate embedded racism and social hierarchy while yeilding lots of cheap workers who can't stand up for themselves.", "Please practice and carry. Owning a gun means nothing unless you have it with you and can use it effectively.", "Soliciting is not allowed, please avoid posting links to marketplaces or store websites, sale alerts, etc.", "Please inform me of news websites relevant to non-usa areas of the world so I can add them", "\n          ", "\n        ", "\n          ", "\n        ", "\n          ", "\n        "]},
{"url": "http://c32zjeghcp5tj3kb72pltz56piei66drc63vkhn5yixiyk4cmerrjtid.onion/f/guns/comments?next%5Btimestamp%5D=2017-11-07T00%3A41%3A10%2B00%3A00&next%5Bid%5D=17371", "title": "Recent comments in /f/guns\n          —\n        Raddle", "title_keywords": {"recent": 1, "comments": 1, "fguns": 1, "": 9, "—": 1, "raddle": 1}, "keywords": {}, "description": "", "meta": {"depth": 3, "download_slot": "c32zjeghcp5tj3kb72pltz56piei66drc63vkhn5yixiyk4cmerrjtid.onion", "download_latency": 2.211846113204956}, "Data": ["\n                  Reply to ", " by ", "\n              ", "Americans are unable to admit that these mass shootings are the result Cultural problem, not a legislative one. Even if laws were to be enacted that met the demands of gun critics, it would still not do anything to change the deepy-seeded culture of toxic aggression and alienation that fuels these shootings.", "Even now in states with much stricter gun laws, the black market is providing anything illegal. So ultimately if one were determined to aqcuire the weapons, the laws themselves would do little to stop it.", "The resulting situation would be that people who are actually trying to follow the law and protect themselves would find it much harder to, while those purchasing from black markets would have little to no problem.", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Damn straight", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Better than nothing amirite?", "\n                  Reply to comment by ", " in ", " by ", "\n              ", "Yeah I haven't heard the best reviews of them. Still, hard to beat this deal for 2 rifles. I hear the ARs are pretty decent tho.", "\n                  Reply to ", " by ", "\n              ", "don't their aks suck?", "Please practice and carry. Owning a gun means nothing unless you have it with you and can use it effectively.", "Soliciting is not allowed, please avoid posting links to marketplaces or store websites, sale alerts, etc.", "Please inform me of news websites relevant to non-usa areas of the world so I can add them", "\n          ", "\n        ", "\n          ", "\n        ", "\n          ", "\n        "]}
]